Revit 2017 API
FormatUtils Members
The FormatUtils type exposes the following members.
Methods
Name | Description
Format |  Obsolete.
 Formats a number with units into a string based on the units formatting settings for a document.
See Also
FormatUtils Class
Autodesk.Revit.DB Namespace